[
  {
    "number": "1",
    "isNew": false,
    "tags": [
      "buzz",
      "crouton"
    ],
    "publishDate": "August 26, 1999",
    "description": "<p>This is the first Blue Rice strip ever, which I suppose makes it noteworthy. It's terrible, but you gotta start somewhere.</p>\n\n<p>That also makes it the first appearance of the original main characters: Crouton (based loosely on myself) and Buzz (based not-so-loosely on a friend of mine). </p>\n\n<p>By far, the most common question I get is \"Where did the name Blue Rice come from?\" Answer: in college, we loved Tuesday nights at a campus bar called R&amp;R's—famous for their \"shark bowls\" (big blue cocktails served in a fishbowl with a plastic shark toy floating inside). One time, after we first had Chinese for dinner, my roommate got so drunk that he threw up blue rice the next day. Buzz, you are my muse.</p>"
  },
  {
    "number": "2",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": "August 27, 1999",
    "description": "<p>First appearance of The Bar, debatably Blue Rice's main character over the course of its three-year run. (Of the 400ish strips that ran in total, well over 50% take place in the bar.)</p>\n\n<p>Also one of the few times that the top of the bar is shown (as opposed to the side) and the only time with a dark background. </p>"
  },
  {
    "number": "3",
    "isNew": false,
    "tags": [
      "buzz",
      "crouton"
    ],
    "publishDate": "August 30, 1999",
    "description": "<p>This strip actually predates Blue Rice altogether, having been written and drawn for a cartoon I attempted before Blue Rice. That cartoon was to star my friend Dano and a human version of Buzz (who, once again, is a real person).</p>"
  },
  {
    "number": "4",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": "August 31, 1999",
    "description": "<p>This is the first time I swear in a Blue Rice strip. (Note: Not the last time.) </p>"
  },
  {
    "number": "5",
    "isNew": false,
    "tags": [
      "bloom county",
      "buzz",
      "crouton"
    ],
    "publishDate": "September 1, 1999",
    "description": "<p>This disturbing strip features the first appearance of my standard visual representation of drunkenness: note the swirls and popping bubbles around Buzz’s head. </p>\n\n<p>(This technique was largely lifted from Bloom County, a great comic strip from the 80s and early 90s and the overall biggest influence on Blue Rice.)</p>"
  },
  {
    "number": "6",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon",
      "mushroom"
    ],
    "publishDate": "September 2, 1999",
    "description": "<p>The first appearance of Gordon the Gnome and the mushroom guy. </p>\n\n<p>Gordon was named for a short friend of mine—a girl whose last name was Gordon. </p>\n\n<p>The mushroom guy was very loosely inspired by another friend of mine. Long story. </p>"
  },
  {
    "number": "7",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "mushroom"
    ],
    "publishDate": "September 3, 1999",
    "description": "<p>I loved Gordon from the very start. Every scenario in life is made funnier with a gnome.</p>\n\n<p>Like Gordon hitting on girls—what does he expect will happen? What would he do if he got the girl?</p>"
  },
  {
    "number": "8",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "crouton",
      "gordon",
      "mushroom"
    ],
    "publishDate": "September 6, 1999",
    "description": "<p>This is the last of the original eight strips I submitted months before Blue Rice was published as a comic in the Daily Illini. </p>\n\n<p>This is also the first strip where I feature four different types of things, one in each panel. I found it to be an easy way to work in a hodgepodge of ideas and characters without having to worry about continuity. </p>\n\n<p>(By the way, one of these pick up lines was actually used by a friend of mine… try to guess which one!)</p>"
  },
  {
    "number": "9",
    "isNew": false,
    "tags": [
      "buzz",
      "crouton"
    ],
    "publishDate": "September 9, 1999",
    "description": "<p>This was the first strip I drew as a published cartoonist (see explanation about the first eight strips under the previous comic). Pretty lame, actually. The only interesting thing about it has to do with the next strip… read on…</p>"
  },
  {
    "number": "10",
    "isNew": false,
    "tags": [
      "spoof"
    ],
    "publishDate": "September 8, 1999",
    "description": "<p>Here’s an interesting one. </p>\n\n<p>Generally speaking, I was told to submit my strips no later than 6pm the day before they ran. But the first strip I drew as a Daily Illini employee (#9, just before this one) was submitted at just about exactly 6pm. I guess I waited too long—the next day, our graphics editor ran a Sylvia cartoon (a syndicated comic aimed at middle-aged women with cats) in place of Blue Rice.</p>\n\n<p>In retaliation, I drew this Blue Rice strip in the artistic and writing style of Sylvia.</p>\n\n<p>Only later did I find out that the creator of Sylvia was actually an University of Illinois alum who read the school paper on a regular basis. I actually felt kinda bad about it at one point, but as they say, kindness is a victim of comedy.</p>"
  },
  {
    "number": "11",
    "isNew": false,
    "tags": [
      "buzz"
    ],
    "publishDate": "September 10, 1999",
    "description": "<p>Buzz’s exact species of bird has never been officially disclosed, but early on he certainly appeared to be a chicken. Later on, he evolved into something much more ducklike.</p>"
  },
  {
    "number": "12",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon",
      "mushroom"
    ],
    "publishDate": "September 13, 1999",
    "description": "<p>Did I mention that my father is a physicist?</p>"
  },
  {
    "number": "13",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": "September 14, 1999",
    "description": "<p>The first self-referencing Blue Rice strip.</p>"
  },
  {
    "number": "14",
    "isNew": false,
    "tags": [
      "buzz",
      "devil"
    ],
    "publishDate": "September 15, 1999",
    "description": "<p>Buzz’s wings have always sort of gone back and forth between being more armlike and winglike, depending on what’s more convenient for me. Check out the bizarre feathers in the second and third panels—later in the series, he almost always just has arms and four feathers at the end that act as fingers.</p>"
  },
  {
    "number": "15",
    "isNew": false,
    "tags": [
      "buzz"
    ],
    "publishDate": "September 16, 1999",
    "description": "<p>The first panel here is one of my all-time favorite Buzz drawings… probably the most true to the actual Buzz.</p>"
  },
  {
    "number": "16",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": "September 17, 1999",
    "description": "<p>This is one of those occasions where I’m embarrassed by the artistic quality of the early strips. That second panel in particular is atrocious—what’s up with Crouton’s head?</p>"
  },
  {
    "number": "17",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": "September 20, 1999",
    "description": "<p>If you asked me to name the single most impactful Blue Rice ever, you're looking at it. </p>\n\n<p>Using the phrase \"Jewish-American Princess,\" combined with comparing the holiest Jewish holiday to a disease generally contracted through raw chicken, was apparently not a very kosher thing to do. This strip opened the floodgates to dozens of phone calls (to the Daily Illini newsroom), email complaints and an impromptu protest in the parking lot. </p>\n\n<p>Here I was in my fourth week as a cartoonist, and my editor told me to write an official apology or possibly lose my job (hence the next strip). On the plus side, the strip started up a nice little \"freedom of speech\" debate and earned me a little notoriety, in the newsroom and on campus.</p>"
  },
  {
    "number": "18",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>This was the follow-up “apology” email after the previous “Jewish-American Princess” strip. Everything I said was sincere, but clearly, I expressed my opinion that some complaints were kinda ridiculous.</p>"
  },
  {
    "number": "19",
    "isNew": false,
    "tags": [
      "buzz",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Again, a follow-up to the Jewish Princess controversy.</p>\n\n<p>This is the first strip that features three characters in the same panel, something made possible by the small amount of space required for the gnome. I later learned this to be a useful tactic for managing a three-way flow of dialogue in comics—particularly with the introduction of Hale the Snail months down the road.</p>"
  },
  {
    "number": "20",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Yet another Jewish Princess-related strip. My mom loved this one, and the Jews on campus seemed to warm up to me a bit after this ran.</p>"
  },
  {
    "number": "21",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Besides being the last (thank God!) Jewish Princess-related strip, there are two interesting things about this cartoon. One is the cameo of Chief Illiniwek, the controversial University of Illinois mascot that dominated campus debate for years and years. </p>\n\n<p>The other factoid has to do with the “Save the Bunny” t-shirt, which was an homage to Bob &amp; Dave—a classic Daily Illini comic that was currently running a “readers’ decide” series on the fate of a cartoon bunny. (I think the bunny lived in the end.)</p>"
  },
  {
    "number": "22",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Looking back, I really didn’t draw the Mushroom guy very well—except for the occasional “shot from below” drawing like in panel 3. </p>"
  },
  {
    "number": "23",
    "isNew": false,
    "tags": [
      "buzz",
      "gordon",
      "square lake"
    ],
    "publishDate": null,
    "description": "<p>The panel 3 mention of Dan Acton refers to the Daily Illini cartoonist who created Square Lake, a brilliantly idiosyncratic comic that ran next to Blue Rice for years. (There are several Square Lake references throughout the run of Blue Rice, including a crossover about halfway through.)</p>\n\n<p>For those of you Blue Rice fans who also enjoyed Square Lake, I found <a href=\"http://www.resounder.org/squarelake/\">this archive</a>.</p>"
  },
  {
    "number": "24",
    "isNew": false,
    "tags": [
      "crouton",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Here’s the second big controversy I experienced as a cartoonist (the first being the Jewish Princess taboo). See that “Bonnie Jeans” on Crouton’s shirt three times? That’s the name of a local Champaign pizza joint, to whom I sold advertising space on my strip for $20 per mention (I think I asked for $50 total for this strip alone).</p>\n\n<p>At the time, I thought it was just a brilliant way to make some extra cash (I earned $8 per strip from the Daily Illini itself). Turns out it was against the rules or something, and after a few more “sponsors” appearing over the next few strips, my boss told me to knock it off or I’d be fired.</p>\n\n<p>Incidentally, I genuinely did love Bonnie Jeans pizza (that’s why I approached them), and when I published my three Blue Rice collections down the road, Bonnie Jeans bought the back cover ad all three times. They closed a few years ago, but I recently heard that they're back (above the Illini Inn on 4th Street). Eat there.</p>"
  },
  {
    "number": "25",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Notice the White Horse name three times in the bar’s wood grain—that’s the bar who bought sponsorship in Blue Rice. (Also happened to be one of our favorite Champaign bars, with really cheap booze, a great beer garden and karaoke on Wednesdays.)</p>\n\n<p>One more fun fact about this strip: the constant vegan-bashing in this storyline led a mild-mannered student to write in and ask why I’m giving vegans such a hard time. He volunteered some info about vegans and suggested I may not understand what they’re all about. Possibly the most polite complaint letter I ever got. Damn nice people, those vegans.</p>"
  },
  {
    "number": "26",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>It’s fun drawing the gnome.</p>"
  },
  {
    "number": "27",
    "isNew": false,
    "tags": [
      "buzz",
      "buzz's mom",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>This begins a storyline revolving around Buzz’s mom coming to visit. The only thing I like about this strip is Buzz drinking while smoking in the second panel—got that from Kramer in a Seinfeld episode.</p>"
  },
  {
    "number": "28",
    "isNew": false,
    "tags": [
      "buzz",
      "buzz's mom",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Though Crouton (patterned on myself) is Blue Rice’s resident Jew, I can’t help but hear Buzz’s mom speak with a Jewish mother’s accent, a la Estelle Harris (Mama Constanza from Seinfeld and Mrs. Potato Head in Toy Story).</p>"
  },
  {
    "number": "29",
    "isNew": false,
    "tags": [
      "buzz",
      "buzz's mom",
      "cain"
    ],
    "publishDate": null,
    "description": "<p>The first appearance of Cain the monkey. Cain was based on a friend of mine named Matt Cain who, on one random bar night, asked me to put him in a strip as a monkey. His girlfriend at the time (now his wife) asked to be a star, so I always have Cain wearing a shirt with a star on it. Timing is everything.</p>"
  },
  {
    "number": "30",
    "isNew": false,
    "tags": [
      "buzz",
      "buzz's mom"
    ],
    "publishDate": null,
    "description": "<p>The real Buzz’s mother also prefers scotch.</p>"
  },
  {
    "number": "31",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>More than most, this strip earns a lot of “that is so true!” comments. Our college apartment had several street signs hanging on the walls, none of which was legal. </p>"
  },
  {
    "number": "32",
    "isNew": false,
    "tags": [
      "buzz",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>One of my all-time favorites, this strip incorporates some of the best things I too-rarely do in Blue Rice (e.g. use three characters instead of two, use more than 4 panels). I really tried to make the first two fortunes accurate in retrospect…though until you get to the punchline, you don’t realize it.</p>\n\n<p>This was also a big plot-driving and character-building strip: after it ran, Gordon was actually absent from Blue Rice for months, and when <a href=\"/Strip/Details/49\">he returned</a> he started getting less innocent and naïve, and more sarcastic and loud. Kinda makes you wonder what happened to him at that restaurant...</p>"
  },
  {
    "number": "33",
    "isNew": false,
    "tags": [
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>I actually did this photocopying trick pretty often in future strips (just comes with the territory of meeting daily deadlines), though I rarely drew attention to it. <a href=\"/Strip/Details/162\">Strip #162</a> does it better.</p>\n\n<p>Oh, and on top of being lazy, I'm also a thief—the whole \"draw attention to photocopied talking heads\" idea was ripped off of a Calvin and Hobbes strip.</p>"
  },
  {
    "number": "34",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>This storyline never went anywhere, but that little guy was fun to draw. I kinda just wanted to draw a drunk-looking version of Toad (from Super Mario Bros).</p>"
  },
  {
    "number": "35",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>My mom HATES when I swear in Blue Rice, so I’m guessing she’s not a fan of this strip. My boss at the time wasn’t very fond of it either. Ironically, this is one of the rare times that the swearing actually contributed to the joke and wasn’t just gratuitous. </p>"
  },
  {
    "number": "36",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>One of the rare slapstick episodes of Blue Rice, this actually has made me laugh out loud on occasion (particularly panel 4). Nothing funnier than child abuse.</p>"
  },
  {
    "number": "37",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>I’ve often been inspired by the 80’s comic Bloom County, but the “thbbbt” in the last panel is straight-up plagiarism. </p>"
  },
  {
    "number": "38",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Just plain weird. </p>"
  },
  {
    "number": "39",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>This strip was the first of a new semester, right after winter break. Besides practicing my drawing (and growing out Crouton’s hair), I had spent that monthlong vacation retooling the strip, trying to focus on character interaction instead of pun-driven story arcs. </p>\n\n<p>My main inspirations were not comics at all, but TV shows like Seinfeld and Friends—I felt that if you build characters that people care about, you can put them in any situation and they’ll just write themselves. I was right.</p>"
  },
  {
    "number": "40",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The first appearance of Katy (based on a real blonde I know by the same name). She’s not drawn great, but at the time this was the hottest girl I'd ever rendered. Right off the bat I enjoyed how she could hold her own with the guys and kept Buzz off-balance.</p>"
  },
  {
    "number": "41",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>For those who don’t remember, Clinton/Lewinksy jokes were still running rampant at this time (January 2000), and there was a detail about how Monica did something with a cigar, after which Bill smoked it and said “it tastes good”. The “cigar is just a cigar” line, however, is my favorite Freud quote.</p>"
  },
  {
    "number": "42",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>This Katy/Cain cousin development never panned out too far, but it did set up <a href=\"/strip/details/215\">a monkey sex storyline one year later</a>. What this did was establish Cain as a guy who likes to watch Buzz fall on his ass.</p>"
  },
  {
    "number": "43",
    "isNew": false,
    "tags": [
      "cain",
      "chair and tv",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>The first Cain-centric strip, as well as the first chair-and-TV strip. I enjoy Cain’s two cigarettes as he watches Emeril.</p>"
  },
  {
    "number": "44",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>I’m not sure when people notice that I’m having a bad drawing day, but this is a perfect example. Crouton’s shirt (really, his whole body) is awful. Cain’s head keeps changing size. And Katy’s not hot at all. Even the lettering was poorly done. I hope we’ve all learned something here today.</p>"
  },
  {
    "number": "45",
    "isNew": false,
    "tags": [
      "bar",
      "bloom county",
      "buzz",
      "cain",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The punchline is surprisingly OK, but this is another example of my ripping off Bloom County (in which the main character, Opus the penguin, is often considering and getting beak surgery).</p>"
  },
  {
    "number": "46",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton",
      "daily illini",
      "foxtrot"
    ],
    "publishDate": null,
    "description": "<p>This is a pure University of Illinois strip. Crouton is reading the Daily Illini, which did have a great police blotter section where you could sometimes find your friends, and the Lincoln bust Buzz peed on is a statue that people rubbed for good luck. </p>\n\n<p>(The “Bulls win 27 straight” newspaper headline—a total joke, considering the Bulls were the worst team in the NBA that year—was an homage to Fox Trot, which often hides fun headlines and pictures in the background.)</p>"
  },
  {
    "number": "47",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain",
      "crouton",
      "katy",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>This was a key strip in establishing the permanent cast of Blue Rice. All six main characters are represented (five shown and the gnome discussed), and I even sprinkled in a little ethnic humor (quotas are rarely good for white males). Crouton’s wearing a shirt I actually owned at the time.</p>"
  },
  {
    "number": "48",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "gordon",
      "katy",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>One of the better “4 Types” strips. Though the mushroom comes off like a real fatass, this was also one of my favorite Gordon drawings—a good sign, considering this was his return from a two-month absence.</p>"
  },
  {
    "number": "49",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Gordon meets Katy for the first time, and even sticks to story details established months earlier (a continuity rarity for Blue Rice). At the time, General Tso’s was my favorite thing to get at Chinese restaurants.</p>"
  },
  {
    "number": "50",
    "isNew": false,
    "tags": [
      "bar",
      "katy",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>I didn’t even get any complaint letters, probably because the word “religion” is too broad to be offensive. Of course, once you get specific it’s a whole other ballgame.</p>"
  },
  {
    "number": "51",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "katy",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>One of my all-time favorites, because people (particularly college students) can relate to all of these. </p>\n\n<p>This strip gave me a chance to work in four different interactions between characters—a rare opportunity to build characters in a “4 Types” strip. On top of that, it's the first strip that featured all six main characters (at the time).</p>\n\n<p>Panel 4 brings up one of my favorite scenes in movies (I love that yellow Ferrari).</p>"
  },
  {
    "number": "52",
    "isNew": false,
    "tags": [
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Perhaps the truest Blue Rice strip ever. </p>\n\n<p>When you’re a college student who shows up to work after class at 4pm, and your comic is due at 6pm, it’s very tempting to work in a character that takes 30 seconds to draw. </p>\n\n<p>This simple fact led to 1) Gordon eventually becoming the main character, 2) Hale the Snail becoming the second main character a year later, and 3) the final storyline of Blue Rice at the end of Year Three, when talking specks of dust were taking over the strip because they took so little time to draw.</p>"
  },
  {
    "number": "53",
    "isNew": false,
    "tags": [
      "4 types",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>At the time this was published, our weekend actually began on Wednesday nights—White Horse, karaoke, ridiculous drink specials (pitchers of rum and coke, cheap hard cider).</p>\n\n<p>I drew this strip shortly after creating a drink I called a \"Creamy Hebrew\": shot of vodka and ranch dressing. (Here's a shout-out to co-creator Mike Sabin, who was the one who had to drink it.)</p>"
  },
  {
    "number": "54",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>This strip is terrible. Not sure why I included it here. Enjoy.</p>"
  },
  {
    "number": "55",
    "isNew": false,
    "tags": [
      "ad",
      "bar",
      "cain",
      "crouton",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>After running this strip, I got an email from some U of I philosophy club that told me they clipped it and put it up on their wall, and even adopted “Nietzsche Liked Nachos” as their slogan. It is pretty fun to say out loud. Try it.</p>"
  },
  {
    "number": "56",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Another strip based on real life. I’ve always been notorious for not noticing little visual things, and once was oblivious to the fact that a friend returned from Thanksgiving break with her hair 50% shorter and bleached blonde.</p>"
  },
  {
    "number": "57",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Not a great strip, but I love the drawing of the gnome on the mushroom’s head in the first panel.</p>\n\n<p>On an unrelated note, The Princess Bride is a great movie.</p>"
  },
  {
    "number": "58",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>This one was fun. Drawing Gordon close-up is always risky—I was often concerned that if I showed him close-up, people wouldn’t think he was cute anymore.</p>"
  },
  {
    "number": "59",
    "isNew": false,
    "tags": [
      "ad",
      "bar",
      "gordon",
      "katy",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>A very common dilemma at a college campus, especially at a college with two dozen pizza places and the original Jimmy Johns. I enjoy this strip because of the art and the inclusion of Ranch dressing, my personal favorite. (My two-year-old Mattie loves it too.)</p>\n\n<p>This particular strip was cut out and hung on the wall of Bonnie Jean’s, my favorite pizzeria that became the Blue Rice <a href=\"/Strip/Details/24\">book sponsor</a>. Love those guys.</p>"
  },
  {
    "number": "60",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Weak.</p>"
  },
  {
    "number": "61",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>A favorite.</p>"
  },
  {
    "number": "62",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "katy",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>I love hot dogs. Embarrassingly, I get them with everything, including ketchup. Blame it on my New York upbringing.</p>"
  },
  {
    "number": "63",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Throughout all of college, I never got a summer internship in my field. I did, however, enjoy some summers as a corn field inspector, wedding DJ, and food critic. This is what happens when you procrastinate. </p>"
  },
  {
    "number": "64",
    "isNew": false,
    "tags": [
      "bloom county",
      "buzz",
      "election"
    ],
    "publishDate": null,
    "description": "<p>Blue Rice's entry into the world of student government. Another direct ripoff from Bloom County.</p>"
  },
  {
    "number": "65",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "election",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Buzz and Katy actually got around 100 write-in votes in the 2000 ISG (Illinois Student Government) election.</p>"
  },
  {
    "number": "66",
    "isNew": false,
    "tags": [
      "buzz",
      "election",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The second-most common question I used to get was \"Is Buzz a chicken or a duck?\"</p>"
  },
  {
    "number": "67",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "election",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "68",
    "isNew": false,
    "tags": [
      "4 types",
      "cain",
      "crouton",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Sadly, we used to watch Dawson's Creek all the time.</p>"
  },
  {
    "number": "69",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Until this point, Gordon was generally portrayed a simple, sweet, happy-go-lucky character. This showed his darker side, which I came to embrace as my alter ego.</p>"
  },
  {
    "number": "70",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>I spent Spring Break 2000 in Daytona with five great friends. Three of the above four panels applied to me.</p>"
  },
  {
    "number": "71",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Seriously, we complained about too much work in college? </p>"
  },
  {
    "number": "72",
    "isNew": false,
    "tags": [
      "chair and tv",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Tae Bo, swing music, Dawson's Creek, Felicity, VH1...pop culture references don't age well, but they do provide a fun slice of the times.</p>"
  },
  {
    "number": "73",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Alex Quigley was a DJ for the student radio station, and also a friend of a friend. I mentioned him in this strip in exchange for him mentioning Blue Rice on the air. He's actually a DJ for Chicago's Q101 now.</p>"
  },
  {
    "number": "74",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "katy",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>I like this strip. Panel 4 was actually an ongoing argument in Champaign at the time.</p>"
  },
  {
    "number": "75",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Unnoticeable to most, this was the first Blue Rice that featured really thick frames on the panels, which is what I did for every strip moving forward. Yeah, nobody cares about this stuff but me. Moving on...</p>"
  },
  {
    "number": "76",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>\"No, I will not make out with you\" was stolen from Adam Sandler in \"Billy Madison\". Not a great strip, though I always enjoy doing more than four panels.</p>"
  },
  {
    "number": "77",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "poem"
    ],
    "publishDate": null,
    "description": "<p>Poem strips are fun to write. I don't think anyone actually reads them.</p>"
  },
  {
    "number": "78",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Always enjoyed hiding text in the bar's wood grain. </p>"
  },
  {
    "number": "79",
    "isNew": false,
    "tags": [
      "bar",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Bullies suck.</p>"
  },
  {
    "number": "80",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>The \"two more days\" hidden in the bar's wood grain was in reference to my 21st birthday, which was just two days away.</p>"
  },
  {
    "number": "81",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Sadly, this is very true to life.</p>"
  },
  {
    "number": "82",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": "April 17, 2000",
    "description": "<p>This was in reference to my 21st birthday that had just occurred, during which I consumed 21 alcoholic drinks. Great day.</p>"
  },
  {
    "number": "83",
    "isNew": false,
    "tags": [
      "bloom county",
      "crouton",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The beginning of a new storyline that was (surprise, surprise!) pretty much stolen from Bloom County. I thought the name \"The Backdoor Boys\" was pretty appropriate.</p>\n\n<p>This was also the first time I drew Katy with this style of eyes (irises and pupils instead of just big black dots).</p>"
  },
  {
    "number": "84",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Some more stolen pop culture: panel 4 is Joey on \"Friends\", and panel 5 is obviously from the famous Bud Light ad campaign, which at this point was only a few months old.</p>"
  },
  {
    "number": "85",
    "isNew": false,
    "tags": [
      "bar",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>This one is funnier to people who know my rotisserie story: right around the time this strip came out, I had gotten drunk one night and ordered Ron Popeil's Showtime Rotisserie Oven off an infomercial for only four easy payments of $39.95. I used it twice.</p>"
  },
  {
    "number": "86",
    "isNew": false,
    "tags": [
      "buzz",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>One year later, a few Daily Illini editors and I actually performed \"Bye Bye Bye\" by NSYNC for a talent show. We practiced for a week and won.  </p>"
  },
  {
    "number": "87",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>True, true...</p>"
  },
  {
    "number": "88",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>The thing I like best about this strip is putting it side by side with Strip #1 and seeing how much better the artwork of Blue Rice has gotten.</p>\n\n<p>(For the record, I did play a lot of Minesweeper back then...but who didn't?)</p>"
  },
  {
    "number": "89",
    "isNew": false,
    "tags": [
      "bar",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>This strip was inspired by a recent Champaign experience (in 2000) when a campus bar got in trouble for serving alcohol to a 13-year-old. They put some stricter age-checking processes in place after that, but Champaign remains the easiest place in America for a teenager to get drunk.</p>"
  },
  {
    "number": "90",
    "isNew": false,
    "tags": [
      "cain",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>This was the last strip published at the end of my first school year, so I purposely put in a \"cliffhanger\" that I had no intention of revisiting later.</p>"
  },
  {
    "number": "91",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "crouton",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>This strip kicked off the summer of 2000, when I opted to stick around Champaign and work at the Daily Illini as a cartoonist, editor, occasional columnist and food critic. One of the best summers ever.</p>\n\n<p>Also the first appearance of the mushroom as a pimp, which became an ongoing storyline soon after.</p>"
  },
  {
    "number": "92",
    "isNew": false,
    "tags": [
      "buzz",
      "chair and tv"
    ],
    "publishDate": null,
    "description": "<p>Panel 3 again refers to the Showtime Rotisserie Oven, of which I was a proud owner.</p>"
  },
  {
    "number": "93",
    "isNew": false,
    "tags": [
      "chair and tv",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Great pants. I actually owned a pair.</p>"
  },
  {
    "number": "94",
    "isNew": false,
    "tags": [
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>One of the rare one-panel strips. </p>"
  },
  {
    "number": "95",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "buzz",
      "cain",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Wrote this one after getting dumped. Good times.</p>"
  },
  {
    "number": "96",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>This strip presents the first time we see the characters from behind, stools and all. Crouton's wearing a Hooters shirt (visible in panel 3) because my friends took me to Hooters the day before, as a result of my getting dumped (see previous strip).</p>\n\n<p>The \"mail-order bride from Ukraine\" was an actual storyline a year later, when Hale the Snail got himself one.</p>"
  },
  {
    "number": "97",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>No comment.</p>"
  },
  {
    "number": "98",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>One of my favorites. My friends and I played a lot of poker, especially during the summer of 2000. Every one of these was based on real people/scenarios, as I'm sure you can relate. Could have done 20 of these and never run out of stereotypes.</p>"
  },
  {
    "number": "99",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Mostly true.</p>"
  },
  {
    "number": "100",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "gordon",
      "katy",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>This strip began a revamp of the mushroom character, reintroducing him A) as a pimp and B) with a different look to his face (especially his eyes). Not a very funny strip, but he was more fun to draw that way.</p>"
  },
  {
    "number": "101",
    "isNew": false,
    "tags": [
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>The \"NOW\" on the woman's shirt stands for \"National Organization for Women,\" a group that was protesting on campus that week. They weren't fond of this strip.</p>"
  },
  {
    "number": "102",
    "isNew": false,
    "tags": [
      "mushroom"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "103",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>It takes a big nerd to laugh at this strip.</p>\n\n<p>My favorite thing about this strip: great lettering. Seriously.</p>"
  },
  {
    "number": "104",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>The first appearance of Hale the Snail, who would eventually become the second most prominent character in Blue Rice. </p>\n\n<p>At the time this strip ran, I actually never expected to bring Hale back. But I actually got a handful of emails from students voting to keep Hale, so I had to honor the deal.</p>\n\n<p>Fun fact: Hale was name for Matthew Hale, Illinois' favorite white supremacist who was pretty active at the time. Not that I liked Matthew Hale, it just happened to rhyme with \"snail.\" To quote the Blues Brothers: I hate Illinois nazis.</p>"
  },
  {
    "number": "105",
    "isNew": false,
    "tags": [
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Fourth of July strip.</p>"
  },
  {
    "number": "106",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "107",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The return of Hale, this time for good.</p>\n\n<p>Hale's quote in the second panel is from \"Shaft\" (the 2000 version with Samuel L. Jackson).</p>\n\n<p>Hale's quote in the third panel is from \"The Rock\" (one of my favorite brainless movies). This panel also shows the first appearance of Gordon and Hale together.</p>"
  },
  {
    "number": "108",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain"
    ],
    "publishDate": null,
    "description": "<p>I actually think that's a pretty good idea. Maybe now there's an app for that.</p>"
  },
  {
    "number": "109",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon",
      "hale",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Hale's shell changes like a dozen times through the series—sometimes the swirl is clockwise, sometimes counterclockwise, sometimes detailed, sometimes simple.</p>"
  },
  {
    "number": "110",
    "isNew": false,
    "tags": [
      "bar",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>For a while, Hale was disliked by all the other characters. Don't remember why.</p>"
  },
  {
    "number": "111",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>The first of maybe five or six times I refer to snail sex. Just go with it.</p>"
  },
  {
    "number": "112",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "buzz",
      "cain",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "113",
    "isNew": false,
    "tags": [
      "buzz",
      "crouton",
      "gordon",
      "katy",
      "saved by the bell"
    ],
    "publishDate": null,
    "description": "<p>Who out there remembers that episode of \"Saved By The Bell\"?</p>"
  },
  {
    "number": "114",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>The first strip focused on Gordon and Hale, who for a long time really didn't like each other at all.</p>"
  },
  {
    "number": "115",
    "isNew": false,
    "tags": [
      "bar",
      "cain"
    ],
    "publishDate": null,
    "description": "<p>This was right around the time all those tobacco industry settlements came down.</p>"
  },
  {
    "number": "116",
    "isNew": false,
    "tags": [
      "bar",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "117",
    "isNew": false,
    "tags": [
      "bar",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>That's Pikachu (from Pokémon) on Katy's shirt. We spent a lot of time playing Pokémon Puzzle League that summer. And the nerd award goes to...</p>"
  },
  {
    "number": "118",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>A favorite.</p>"
  },
  {
    "number": "119",
    "isNew": false,
    "tags": [
      "chair and tv",
      "crouton",
      "full house",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Created this strip shortly after learning that a new friend had spent a couple years in prison for robbing a bank. We respected him so much more after hearing about that.</p>"
  },
  {
    "number": "120",
    "isNew": false,
    "tags": [
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "121",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>One of the best-drawn Blue Rices ever. Everyone love Shawshank.</p>"
  },
  {
    "number": "122",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Even 11 years ago, OJ jokes were pretty outdated. Oh well.</p>"
  },
  {
    "number": "123",
    "isNew": false,
    "tags": [
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>The first strip of Year Two (my senior year). </p>\n\n<p>If you've never spent time in Champaign, the South Farms are an agricultural area just south of town that (when the wind blows the wrong way) make campus smell like manure. Can't make this stuff up.</p>"
  },
  {
    "number": "124",
    "isNew": false,
    "tags": [
      "amanda",
      "buzz"
    ],
    "publishDate": null,
    "description": "<p>This is the same pickup line that Buzz first tried on Katy (Strip #40).</p>"
  },
  {
    "number": "125",
    "isNew": false,
    "tags": [
      "amanda",
      "bar",
      "buzz"
    ],
    "publishDate": null,
    "description": "<p>As an upperclassman, dating freshmen is never a good idea. They don't need to drink to have a good time, and even once they discover beer, they need fake IDs to get into the bars. You've been warned.</p>"
  },
  {
    "number": "126",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Champaign has a great engineering program, with top-notch facilities and faculty and even their own campus. As a result, engineering students are a class of their own at U of I. They're also a very easy target.</p>"
  },
  {
    "number": "127",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Panel 4 is one of my favorite Blue Rice pictures—a drawing I wanted to do since first introducing Katy (back in strip #40) but didn't really have the skills for until around this point.</p>"
  },
  {
    "number": "128",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Buzz is drinking a \"personal pitcher\"—a great college-town product inspired by the belief that beers should be consumed pitchers at a time without sharing. Those were the days.</p>"
  },
  {
    "number": "129",
    "isNew": false,
    "tags": [
      "amanda",
      "bar",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>One of those great \"four photocopied panels\" that just works. </p>"
  },
  {
    "number": "130",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "crouton",
      "full house",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>\"Full House\" was like a car crash: truly terrible, but impossible to look away.</p>"
  },
  {
    "number": "131",
    "isNew": false,
    "tags": [
      "hale"
    ],
    "publishDate": null,
    "description": "<p>\"No Shells.\" Ha.</p>"
  },
  {
    "number": "132",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "devil"
    ],
    "publishDate": null,
    "description": "<p>The devil was patterned after a girl who worked at The Daily Illini, an editor named Amanda L. Later that year, she would become the Opinions Editor and I became a columnist, so she was my boss.</p>"
  },
  {
    "number": "133",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Crouton is drinking a Guinness, because if he could get free beer for life, of course he'd go for the heaviest, most expensive one.</p>"
  },
  {
    "number": "134",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>This is what I actually look like when I'm hung over.</p>"
  },
  {
    "number": "135",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "devil",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>I love panel 4. Still relevant today. (Conan O'Brien is freakin' huge!)</p>"
  },
  {
    "number": "136",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>My circle of friends bets on everything, particularly the duration of relationships. I once lost money to Buzz betting on my own relationship (it lasted longer than I expected).</p>"
  },
  {
    "number": "137",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Panel 3 became my original Facebook profile picture.</p>"
  },
  {
    "number": "138",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Around this time (late 2000), the hot thing in college was \"purity tests\": long quizzes (usually 100 questions) that asked all sorts of personal question in a yes-or-no format, most of which had to do with sex, alcohol and drugs. The more times you answer \"yes\", the lower your score got, and the less pure you were. In almost every purity test, to achieve a \"perfect score\" of zero, you'd have to be involved in an animal orgy.</p>"
  },
  {
    "number": "139",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "god",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>For all the times I mention God in Blue Rice, I think this is the only time I've ever drawn Him. The devil, on the other hand, appears in around a dozen strips. Go figure.</p>"
  },
  {
    "number": "140",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Drew this one after a blistering Illini football game. A favorite.</p>"
  },
  {
    "number": "141",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>A bunch of references to the scene in \"Wayne's World\" where the owner of Noah's Arcade gets skewered on Wayne's show. Pretty weak strip, really.</p>\n\n<p>Only interesting thing about this strip was that I got a complaint letter about all the swearing in Blue Rice, from a guy who said \"Great strips like Peanuts and Ziggy don't have to resort to swearing.\" I had a field day with that one (see strip #150).</p>"
  },
  {
    "number": "142",
    "isNew": false,
    "tags": [
      "bar",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>At around this time, cell phones were becoming increasingly common but still owned by less than 50% of people. Cell phone etiquette was a long ways away.</p>"
  },
  {
    "number": "143",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>I hate when people say \"Boo-ya\", yet I say it in the strip a lot.</p>"
  },
  {
    "number": "144",
    "isNew": false,
    "tags": [
      "bar",
      "buzz"
    ],
    "publishDate": null,
    "description": "<p>Gonzo was always my favorite Muppet. He's now my two-year-old daughter's favorite Muppet. She will never be allowed to read Blue Rice. Ever.</p>"
  },
  {
    "number": "145",
    "isNew": false,
    "tags": [
      "buzz's mom",
      "crouton",
      "saved by the bell"
    ],
    "publishDate": null,
    "description": "<p>Crouton is watching what appears to be a pretty racy episode of \"Saved By The Bell\". He's also eating BBQ and Avacado chips, which I would totally buy if it existed. Get the scientists on it right away.</p>"
  },
  {
    "number": "146",
    "isNew": false,
    "tags": [
      "bar",
      "buzz's mom",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>In the first panel, Gordon is repeated an actual Winston Churchill quote. </p>\n\n<p>Lady Nancy Astor: \"Winston, if you were my husband, I would poison your tea.\"</p>\n\n<p>Churchill: \"Madam, if I were your husband, I would drink it.\"</p>\n\n<p>The rest of this strip is pure nonsense. </p>"
  },
  {
    "number": "147",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "buzz's mom",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "148",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "buzz's mom",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>One panel strips are a fun way to work in a lot of characters and get a good dialogue flow going. As long as the gnome says something stupid, it usually works.</p>"
  },
  {
    "number": "149",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "buzz's mom"
    ],
    "publishDate": null,
    "description": "<p>This strip was created as a reaction to a complaint letter I received for swearing too much in Blue Rice. (I think the letter was referring to strip #141; see commentary there.) </p>"
  },
  {
    "number": "150",
    "isNew": false,
    "tags": [
      "ad",
      "bar",
      "crouton",
      "gordon",
      "spoof"
    ],
    "publishDate": null,
    "description": "<p>As you'll see in the commentary on strip #141, I was informed by an angry reader that Ziggy was a great strip that never had to resort to swearing. He's half right.</p>\n\n<p>Remember when fisherman's hats were considered cool? </p>"
  },
  {
    "number": "151",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "buzz",
      "cain",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Panel 4 must have subconsciously planted a seed, because 10 years later <a href=\"/Strip/Details/N11\">I introduced Buzz's baby \"Dizzy\"</a> as a character.</p>"
  },
  {
    "number": "152",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Time it takes to draw Katy: 8 minutes. </p>\n\n<p>Time it takes to draw Gordon without his hat: 14 seconds.</p>"
  },
  {
    "number": "153",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Great thing about the bar as an artistic device: I can raise or lower it in a given strip based on how much text there is, so even a strip with miniature characters and little dialogue can fill up the panels. </p>"
  },
  {
    "number": "154",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The anniversary of the previous year's <a href=\"/Strip/Details/17\">Yom Kippur hoopla.</a></p>"
  },
  {
    "number": "155",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>A fan favorite. And totally true. (Though it does make you wonder how Hale is holding the cards in panel 1.)</p>"
  },
  {
    "number": "156",
    "isNew": false,
    "tags": [
      "4 types",
      "cain",
      "crouton",
      "election",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Election 2000 was just a treasure trove of material. (I voted Libertarian that year.)</p>"
  },
  {
    "number": "157",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Always enjoyed the self-referencing strips, which are fun in moderation. This one in particular is truly a microcosm of Blue Rice in general...</p>"
  },
  {
    "number": "158",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>This strip marks the beginning of the end of the Mushroom guy. Nothing against the guy, he just didn't work out, probably because he A) never really had a well-defined personality and B) took too long to draw.</p>"
  },
  {
    "number": "159",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "mushroom"
    ],
    "publishDate": null,
    "description": "<p>Last appearance of the Mushroom. Is it better to burn out or fade away?</p>"
  },
  {
    "number": "160",
    "isNew": false,
    "tags": [
      "ad",
      "bar",
      "crouton",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "161",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Every now and then, it's fun to draw a really elaborate drink.</p>"
  },
  {
    "number": "162",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>One of three times I used this joke—better than <a href=\"/Strip/Details/33\">the first time</a> but not as good as <a href=\"/Strip/Details/N14\">the last.</a></p>"
  },
  {
    "number": "163",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>And Cocoa Puffs are the shit.</p>"
  },
  {
    "number": "164",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>This strip ran almost halfway through our Senior year, so needless to say a number of us were concerned about life outside the bubble.</p>"
  },
  {
    "number": "165",
    "isNew": false,
    "tags": [
      "bar",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "166",
    "isNew": false,
    "tags": [
      "katy"
    ],
    "publishDate": null,
    "description": "<p>\"Telnet\" was U of I's email portal. This joke wasn't funny then, and it sure hasn't aged well. (Thanks, Buck.)</p>"
  },
  {
    "number": "167",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Good Guinness drawing in panel 2. Mmm, Guinness.</p>"
  },
  {
    "number": "168",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Personally, I opted for #4: applied for grad school, got in, put off real life for another year. Jackpot.</p>"
  },
  {
    "number": "169",
    "isNew": false,
    "tags": [
      "bar",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The real Katy used the drawing in panel 3 as her Facebook page for months. (She's a lawyer now.)</p>"
  },
  {
    "number": "170",
    "isNew": false,
    "tags": [
      "buzz",
      "election",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Shameless plug for the first Blue Rice book in panel 2. It worked.</p>"
  },
  {
    "number": "171",
    "isNew": false,
    "tags": [
      "ad",
      "bar",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Carrying over from the previous strip, this one was published on the day the Blue Rice book (titled \"Rice Rice Baby\") was first available at a campus bookstore. On this day, I also held a book signing at the campus record store, mostly as a way to meet girls. (My future wife actually attended. May this be a tale of hope for nerds everywhere.)</p>"
  },
  {
    "number": "172",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "cain",
      "crouton",
      "gordon",
      "hale",
      "poem"
    ],
    "publishDate": null,
    "description": "<p>Does anybody out there actually read the poem strips? Anyone?</p>"
  },
  {
    "number": "173",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain",
      "election"
    ],
    "publishDate": null,
    "description": "<p>Great thing about this strip: panel 4 can actually apply to the candidates in just about any year. (But especially true in 2000. And 2004. Pretty much any race W was involved.)</p>"
  },
  {
    "number": "174",
    "isNew": false,
    "tags": [
      "bar",
      "election",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>I think something like 15% of Champaign students voted. <a href=\"http://en.wikipedia.org/wiki/United_States_presidential_election,_2000#Results\">Fun night.</a></p>"
  },
  {
    "number": "175",
    "isNew": false,
    "tags": [
      "bar",
      "election",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>This was probably the best political strip I ever did, for a bunch of reasons:</p>\n\n<p>1) I drew/submitted it on Election Day before the polls closed, with the goal of making it work regardless of who won. Funny thing, though...one day later when it ran, the country still didn't know who won. One of the rare times that hedging one's bets actually worked—sort of like flipping a coin and betting it lands on its side.</p>\n\n<p>2) Panel 2 called out what many Daily Illini staffers actually threatened to do if Bush won. (Four years later, these were the people who threatened to move to Canada if Bush won again, and yet none of them ever followed through.)</p>\n\n<p>3) Panel 3 is just fun.</p>\n\n<p>4) If I remember correctly, panel 4 is based on a Bush/Cheney exchange that was caught on microphone.</p>"
  },
  {
    "number": "176",
    "isNew": false,
    "tags": [
      "bar",
      "election",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>More election coverage. (What can I say, it was kind of a big deal at the time.) I'm just proud of my Florida drawings.</p>"
  },
  {
    "number": "177",
    "isNew": false,
    "tags": [
      "election"
    ],
    "publishDate": null,
    "description": "<p>Last of the Election 2000 strips. Best thing about this election series was that I actually beat out The Onion on a few jokes, like <a href=\"http://www.theonion.com/articles/bush-or-gore-a-new-era-dawns,192/\">hedging the outcome</a>, <a href=\"http://www.theonion.com/articles/nation-plunges-into-chaos,187/\">faux civil war</a>, <a href=\"http://www.theonion.com/articles/communication-with-florida-cut-off,190/\">dumping Florida</a> and <a href=\"http://www.theonion.com/articles/clinton-declares-self-president-for-life,191/\">Clinton hanging on a while longer.</a></p>"
  },
  {
    "number": "178",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>This strip began by drawing panel 2—I wanted an excuse to show Buzz doing a spit take. The rest was just filler.</p>"
  },
  {
    "number": "179",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Looking back, I'm surprised I only had to resort to this once. </p>"
  },
  {
    "number": "180",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Well known test-taking fact: if you're out of time on a multiple-choice test, answer all C's.</p>"
  },
  {
    "number": "181",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>In the first panel, Gordon's quoting \"The Thong Song\" (by Sisqo)—a timeless classic.</p>"
  },
  {
    "number": "182",
    "isNew": false,
    "tags": [
      "bar",
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>First Jewish strip in a while. Best to spread these things out.</p>"
  },
  {
    "number": "183",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Crouton's wearing a Buffalo Wild Wings shirt, which at the time was better known as BW3 and found mostly on college campuses.</p>"
  },
  {
    "number": "184",
    "isNew": false,
    "tags": [
      "bar",
      "gordon"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "185",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p><a href=\"http://en.wikipedia.org/wiki/Reproductive_system_of_gastropods\">It's true.</a></p>"
  },
  {
    "number": "186",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "187",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>As Jeff just pointed out below, Panel 3 is taken directly from an episode of Saved By The Bell when Jessie was taking caffeine pills. Panel 4 references <a href=\"http://en.wikipedia.org/wiki/Miss_Cleo\">Miss Cleo</a>, host of the most popular psychic hotline in 2000.</p>"
  },
  {
    "number": "188",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>One of my top five favorite strips. Can't really say why.</p>"
  },
  {
    "number": "189",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "crouton",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "190",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "devil"
    ],
    "publishDate": null,
    "description": "<p>This strip was part of a Secret Santa Christmas gift I gave to a Daily Illini coworker: the Devil in panel 4 looked like her, and Crouton's emphasis on \"A Loan\" was a nod to her name (Amanda Loan).</p>"
  },
  {
    "number": "191",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "crouton",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Strips about tests really don't age well, do they?</p>"
  },
  {
    "number": "192",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>This was the first strip of 2001: beginning of a new semester and (some would say) a new millennium. Everyone knows panel 3 is taken from Back To The Future. Less known is that panel 2 is taken from the Simpsons episode when Homer's new boss is a Bond villain named Hank Scorpio; Scorpio asks Homer \"what's your least favorite country, Italy or France?\" and when Homer says \"France,\" Scorpio adjusts a giant laser and says \"Heh heh heh...nobody ever says Italy.\" Best. Episode. Ever.</p>"
  },
  {
    "number": "193",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Crouton's panel 2 comment is partly true: throughout my college run, I put on a total of around 60 pounds. Go back and look at how skinny Crouton was in the early strips vs the late ones and you'll get a pretty accurate picture.</p>"
  },
  {
    "number": "194",
    "isNew": false,
    "tags": [
      "cain",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Based on a true story. After one night out at a bar, our friend Cindy went to the restroom at a bar and the rest of us just left. Whoops.</p>"
  },
  {
    "number": "195",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>A fan favorite. And probably the best smoking rubber band I've ever drawn.</p>\n\n<p>Panel 2 was one of my first attempts to show the bar from different angles. It didn't take.</p>"
  },
  {
    "number": "196",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>A continuation of the previous strip. This, kids, is why you don't smoke rubber bands.</p>"
  },
  {
    "number": "197",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "hale",
      "poem"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "198",
    "isNew": false,
    "tags": [
      "buzz",
      "crouton",
      "gordon",
      "katy",
      "poem"
    ],
    "publishDate": null,
    "description": "<p>Even then, I knew we were getting too old for that lifestyle. (Panel 3 was drawn from real life, or may as well have been.)</p>"
  },
  {
    "number": "199",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "200",
    "isNew": false,
    "tags": [
      "buzz",
      "spoof"
    ],
    "publishDate": null,
    "description": "<p>The beginning of a five-strip storyline inspired by the movie \"Dude, Where's My Car?\" Buzz's speech bubble in the last panel was also a spoof of the movie's logo.  </p>"
  },
  {
    "number": "201",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Proud of that cow drawing. That's about it.</p>"
  },
  {
    "number": "202",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Buzz was a lot of fun to draw without his beak...certain positions (like panels 3 and 4) would be impossible to draw if his beak was still on. Not really sure what happened to his beer after panel 2, though.</p>"
  },
  {
    "number": "203",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "204",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>This \"Dude\" finale wrote itself—I just draw a different bird's beak on each character and figured by the time I got to the end, the gnome would save the strip. I don't say this enough, but thank you, Gordon.</p>"
  },
  {
    "number": "205",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Guinness was always one of my favorite drinks to draw.</p>"
  },
  {
    "number": "206",
    "isNew": false,
    "tags": [
      "bar",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>For Illini Basketball fans: Gordon is doing shots with Brian Cook, a star of the 2000-2001 team, on the eve of one the biggest and best games in Champaign history. Later that day, Illinois defeated Michigan (ranked #4 nationally) in the first \"Paint the Hall Orange\" game, which had since become a frequent tradition on campus. </p>\n\n<p>Amazingly, I think this was the only time I've ever shown Gordon line up shots.</p>"
  },
  {
    "number": "207",
    "isNew": false,
    "tags": [
      "4 types",
      "cain",
      "crouton",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>As a result of this strip, I got to cross \"draw a gnome in a dominatrix outfit with a goat\" off my bucket list.</p>"
  },
  {
    "number": "208",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Crouton's pizza-sauce face was inspired by my friend Brian (aka Online, aka Buck), messiest eater I know. Buzz in the last panel is inspired by me -- the only person I know who gets the hot dogs at 7-11.</p>"
  },
  {
    "number": "209",
    "isNew": false,
    "tags": [
      "crouton"
    ],
    "publishDate": null,
    "description": "<p>Oddly enough, in 2011 the most dated thing about this strip is that he's checking AN ANSWERING MACHINE.</p>"
  },
  {
    "number": "210",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Not a great strip, but splitting the last panel in two inspired the next strip.</p>"
  },
  {
    "number": "211",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Some strips I just draw for my own entertainment.</p>"
  },
  {
    "number": "212",
    "isNew": false,
    "tags": [
      "bar",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "213",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "214",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Lame strip. Only redeeming quality is that panel 2 stands alone as the only time two characters ever clinked drinks and said \"cheers\". Maybe I can make a t-shirt out of it or something...</p>"
  },
  {
    "number": "215",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "monkey"
    ],
    "publishDate": null,
    "description": "<p>The first of a story arc that <a href=\"/strip/details/42\">picks up where the introduction of Katy left off.</a> </p>"
  },
  {
    "number": "216",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale",
      "katy",
      "monkey"
    ],
    "publishDate": null,
    "description": "<p>One reason I sometimes (okay, often) resort to copying and pasting character drawings from one panel to the next is that it can be tough to keep proportions consistent. Look at the difference between Katy in panels 1 and 2: her head gets much narrower and her body looks oddly warped. </p>"
  },
  {
    "number": "217",
    "isNew": false,
    "tags": [
      "bar",
      "katy",
      "monkey"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "218",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy",
      "monkey"
    ],
    "publishDate": null,
    "description": "<p>As my friend Drew recently reminded me, my editor almost didn't give me the green light for this strip because of panel 3. It was eventually determined that this portrayed only \"implied monkey sex\" and not \"explicit monkey sex,\" so we ran it. </p>\n\n<p>I'm just ashamed at how poorly that woman's back was drawn. My Life Drawing 101 professor would have been so ashamed.</p>"
  },
  {
    "number": "219",
    "isNew": false,
    "tags": [
      "cain",
      "election",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>This was the first time Gordon and Hale ran for student government president and vice president, but not the last. (I was mostly just proud of the David vs Goliath drawing in panel 3.)</p>"
  },
  {
    "number": "220",
    "isNew": false,
    "tags": [
      "bar",
      "election",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>In this first time they ran for office, I was encouraging students to enter their names as write-in votes. Always a long shot.</p>"
  },
  {
    "number": "221",
    "isNew": false,
    "tags": [
      "election",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "222",
    "isNew": false,
    "tags": [
      "bar",
      "election",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "223",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton",
      "election",
      "gordon",
      "hale",
      "holiday"
    ],
    "publishDate": null,
    "description": "<p>For those unfamiliar, Unofficial St Patrick's Day was an official thing in Champaign. Scheduled the Friday before St Patrick's Day, it involved bars opening at 8am, going to class drunk and throwing up green beer in public (not necessarily in that order). </p>"
  },
  {
    "number": "224",
    "isNew": false,
    "tags": [
      "bar",
      "election",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>I learned that student government comics were all about endgame: voting took place online over a two-day period, so the storyline shifts from \"aren't we silly\" to \"go vote for us.\" The three guys shown in the last panel were the actual three candidates for president that year (the middle guy won).</p>\n\n<p>Moment of pride: rendering Lincoln the Gnome in about twelve strokes.\nMoment of shame: misspelling \"embarrass\" in panel 2.</p>"
  },
  {
    "number": "225",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "election",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>As mentioned under the previous strip, this comic ran on Day 2 of online voting, which helps drum up votes but doesn't make for very funny jokes. </p>\n\n<p>Election 2001 outcome: Gordon and Hale each got 200+ write-in votes, not nearly enough to win but still an impressive showing (and enough to make one candidate lose by around 50 votes—ha ha!).</p>"
  },
  {
    "number": "226",
    "isNew": false,
    "tags": [
      "4 types"
    ],
    "publishDate": null,
    "description": "<p>\"Get those poor people away from my beer\"—another possible t-shirt.</p>"
  },
  {
    "number": "227",
    "isNew": false,
    "tags": [
      "4 types"
    ],
    "publishDate": null,
    "description": "<p>Really enjoyed the rabbi in panel 4; possibly the only time I've ever drawn a rabbi. One of those things I could get away with where others couldn't.</p>\n\n<p>(Correction: only time I've drawn a rabbi who wasn't a rabbit.)</p>"
  },
  {
    "number": "228",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "229",
    "isNew": false,
    "tags": [
      "4 types",
      "bar",
      "buzz",
      "cain",
      "crouton",
      "gordon",
      "hale",
      "sports"
    ],
    "publishDate": null,
    "description": "<p>I remember very clearly having an \"off drawing day\" with this strip. Ugh.</p>"
  },
  {
    "number": "230",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "231",
    "isNew": false,
    "tags": [
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Probably my favorite Blue Rice strip. 'Nuff said.</p>"
  },
  {
    "number": "232",
    "isNew": false,
    "tags": [
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Things I could not draw in 2001: people looking up, people looking back, trees, backpacks.</p>"
  },
  {
    "number": "233",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>This strip ran on my last day as the Daily Illini Graphics Editor (editors had one-year terms that ran March to March). </p>\n\n<p>It also preceded a one-week hiatus I was taking because apparently I couldn't keep up with the exhausting daily schedule of two hours of cartooning on top of two hours of class. </p>\n\n<p>Most interesting, however, was that this strip prompted a number of people to believe I had been fired as a cartoonist. I let them believe that for a little while—my weeklong hiatus fueled the rumors, and my replacement as Graphics Editor (fellow cartoonist Marty Smith) decided to play along as well in his own strip. Thanks, Marty!</p>"
  },
  {
    "number": "234",
    "isNew": false,
    "tags": [
      "buzz",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>This was my first strip after my weeklong hiatus (see previous commentary), so I wanted to do a little something different. This began a storyline in which the characters go to a coffee shop instead of the bar. </p>"
  },
  {
    "number": "235",
    "isNew": false,
    "tags": [
      "buzz",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Good art in this one. Fun drawing the characters with coffee mugs instead of alcoholic beverages. The couch gave me a chance to show the characters in a more three-dimensional (ok, two-dimensional) way that the bar couldn't. I had long wanted to do a coffee shop series but didn't have the confidence to draw it...after almost two years, I finally got up the nerve.</p>\n\n<p>The characters in the last panel are from Killroy, Marty Smith's comic in the Daily Illini. In this week we did a crossover with each other's strips on the comics page (I think Blue Rice characters appeared in his strip as well). Killroy was hands-down the best drawn strip in the DI at the time. Marty, if you're reading this, let me know if we can see Killroy anywhere!</p>"
  },
  {
    "number": "236",
    "isNew": false,
    "tags": [
      "buzz",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>More coffee shop, more Killroy, more unique fun. Love that drawing of Buzz, especially \"old book by dead jerk\" (I hate Hemingway!).</p>"
  },
  {
    "number": "237",
    "isNew": false,
    "tags": [
      "buzz",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>Gordon is not easy to draw from behind.</p>"
  },
  {
    "number": "238",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "239",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "240",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "thompson"
    ],
    "publishDate": null,
    "description": "<p>The introduction of Thompson (named for Hunter S), who would go on to become a main character from this point on. </p>"
  },
  {
    "number": "241",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "thompson"
    ],
    "publishDate": null,
    "description": "<p>Thompson's appearance changed a bit between his first appearance and his second, but remained fairly consistent from here on out.</p>\n\n<p>Around this time I was trying some new things in the strip, e.g. leaving out the border in panel 2, using lowercase font in speech balloons, playing with line thicknesses on character renderings. Oh, and all the drugs. </p>"
  },
  {
    "number": "242",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "thompson"
    ],
    "publishDate": null,
    "description": "<p>I think I was reading a lot of <a href=\"http://www.crumbproducts.com/\">R Crumb</a> around this time.</p>"
  },
  {
    "number": "243",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "244",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "245",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "246",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "247",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "scout"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "248",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "249",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "250",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "251",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "252",
    "isNew": false,
    "tags": [
      "bar",
      "crouton"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "253",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "254",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "cain",
      "foxtrot",
      "gordon",
      "hale",
      "katy",
      "spoof"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "255",
    "isNew": false,
    "tags": [
      "buzz",
      "gordon"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "256",
    "isNew": false,
    "tags": [
      "bar",
      "cain",
      "hale",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "257",
    "isNew": false,
    "tags": [
      "bar",
      "crouton",
      "gordon",
      "spoof"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "258",
    "isNew": false,
    "tags": [
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "259",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "crouton"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "260",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "261",
    "isNew": false,
    "tags": [
      "bar",
      "buzz"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "262",
    "isNew": false,
    "tags": [
      "bar",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "263",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "264",
    "isNew": false,
    "tags": [
      "bar",
      "hale",
      "katy",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "265",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "266",
    "isNew": false,
    "tags": [
      "ad",
      "bar",
      "buzz",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "267",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "268",
    "isNew": false,
    "tags": [
      "bar",
      "buzz"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "269",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "270",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "271",
    "isNew": false,
    "tags": [
      "bar",
      "katy",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "272",
    "isNew": false,
    "tags": [
      "bar",
      "katy",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "273",
    "isNew": false,
    "tags": [
      "bar",
      "hale",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "274",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "275",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "276",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "katy",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "277",
    "isNew": false,
    "tags": [
      "bar",
      "buzz",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "278",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "katy"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "279",
    "isNew": false,
    "tags": [
      "4 types",
      "buzz",
      "gordon",
      "katy",
      "thompson"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "280",
    "isNew": false,
    "tags": [
      "ad",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "281",
    "isNew": false,
    "tags": [
      "bar",
      "gordon"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "282",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "283",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "284",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "285",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "286",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "287",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "288",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "289",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "290",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "291",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "292",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "293",
    "isNew": false,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "294",
    "isNew": false,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "N1",
    "isNew": true,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Blue Rice was a college comic strip that ran in the Daily Illini (Champaign-Urbana) from 1999-2002. After a nine-year hiatus, it has come out of retirement to help you waste time at work. </p>\n\n<p>Featured here are the first 280ish Blue Rice strips as well as 16 new ones, with more on the way soon. (Please forgive the early ones.) I'm also adding strip-by-strip, behind-the-scenes commentary, which now runs through the first 177 comics.</p>\n\n<p>Blue Rice has always been driven by its fans, so be sure to share your comments here and on <a href=\"http://www.facebook.com/pages/Blue-Rice/115880128491987\">Facebook</a>. The more you read, the more I draw!</p>\n\n<p>Enjoy,</p>\n\n<p>Shachar Meron</p>"
  },
  {
    "number": "N2",
    "isNew": true,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>This strip and the next one are special: they were produced and published (on Facebook) in 2007, five years after Blue Rice ended and four years before it started up again. Back then, I had ambitions of starting the strip up again, but only made two strips before it fizzled out. Until now.</p>\n\n<p>This strip established the first new storyline, namely the idea that Gordon has been out of the loop for the past nine years while the rest of the characters have continued on. Hard to believe that by 2002, \"The Family Guy\" had been off the air for a couple of years. Dark times.</p>"
  },
  {
    "number": "N3",
    "isNew": true,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Like the strip before, this one was originally developed in 2007, and sums up the decade pretty well.</p>\n\n<p>(Note that Hale is smoking, because in 2007 smoking was still legal in Illinois bars. Moving forward, you'll likely never again see characters smoke at the bar—one of the biggest differences between Blue Rice and Blue Rice 2.0.)</p>"
  },
  {
    "number": "N4",
    "isNew": true,
    "tags": [
      "bar",
      "buzz",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>This strip shows the return of Buzz, who (on the surface) hasn't changed much since 2002.</p>\n\n<p>Written and drawn in early March 2011, this strip was A) completed a few weeks before Donald Trump reentered the spotlight as a political figure, and B) published one day before Osama bin Laden was killed. Weird.</p>"
  },
  {
    "number": "N5",
    "isNew": true,
    "tags": [
      "buzz",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>If the 2002 version of you could contact the 2011 version of you, what would you ask yourself?</p>"
  },
  {
    "number": "N6",
    "isNew": true,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": "<p>Kinda makes you wonder if we really deserve the internet.</p>"
  },
  {
    "number": "N7",
    "isNew": true,
    "tags": [
      "bar",
      "cain",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>This is the first regular (i.e. non-storyline) new Blue Rice, and one of my favorites. It also features the reintroduction of Katy (a bartender, as she was in 2001) and Cain (who had been written out of the strip in 2001). People tend to like Gordon's \"chair\" in this one.</p>\n\n<p>For the record: Peanut Butter Cups are the best, and Tootsie Rolls suck.</p>"
  },
  {
    "number": "N8",
    "isNew": true,
    "tags": [
      "bar",
      "gordon"
    ],
    "publishDate": null,
    "description": "<p>I drew this one while sitting at Murphy's Pub in Champaign on a recent day trip down there.</p>\n\n<p>People who know me know this one is very true to life—whiskey (particularly Jack Daniels) on the rocks is my signature drink. I'm having one right now. L'chaim.</p>"
  },
  {
    "number": "N9",
    "isNew": true,
    "tags": [
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Just a little something different. </p>"
  },
  {
    "number": "N10",
    "isNew": true,
    "tags": [
      "bar",
      "buzz",
      "crouton",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>Another fan favorite. Bar trivia is extremely popular in my circle of friends, and having supplanted karaoke as the weekday bar ritual of choice. (The unspoken question here is \"What was the capital of West Germany, and yes, the answer is Bonn. Hale would never get that wrong.)</p>\n\n<p>This strip also presents the first time we see the rest of the bar. </p>"
  },
  {
    "number": "N11",
    "isNew": true,
    "tags": [
      "buzz",
      "dizzy",
      "gordon",
      "hale",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The beginning of a new storyline in which we learn Buzz is a father, with a one-year-old duckling named Dizzy. Stay tuned to see who his wife is.</p>"
  },
  {
    "number": "N12",
    "isNew": true,
    "tags": [
      "dizzy",
      "hale",
      "jessica",
      "katy"
    ],
    "publishDate": null,
    "description": "<p>The real-life Buzz also married a voluptuous redhead. </p>"
  },
  {
    "number": "N13",
    "isNew": true,
    "tags": [
      "cain",
      "crouton"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "N14",
    "isNew": true,
    "tags": [
      "bar",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "N15",
    "isNew": true,
    "tags": [
      "crouton"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "N16",
    "isNew": true,
    "tags": [
      "bar",
      "buzz",
      "gordon",
      "hale"
    ],
    "publishDate": null,
    "description": null
  },
  {
    "number": "N17",
    "isNew": true,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "N18",
    "isNew": true,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "N19",
    "isNew": true,
    "tags": [],
    "publishDate": null,
    "description": null
  },
  {
    "number": "N20",
    "isNew": true,
    "tags": [],
    "publishDate": null,
    "description": null
  }
]